#+TITLE: Ejercicios del Tema 7
#+SUBTITLE: Punteros
#+AUTHOR: 
#+DATE: 
#+SETUPFILE: config.org
#+PROPERTY: header-args :exports none
#+EXPORT_FILE_NAME: ejercicios_tema7_punt.pdf


* Cambio de dos variables 

Escribe un programa que, con una función que trabaja con el paso por referencia, intercambia el valor de dos variables. Emplea el siguiente prototipo:

#+BEGIN_SRC C :exports code
void cambio (int *p, int *q);
#+END_SRC


#+BEGIN_SRC C
#include <stdio.h>

void cambio (int *p, int *q);

int main()
{
  int a = 1, b = 7;

  printf("a vale %d y b vale %d\n", a, b);
  // Función que intercambia el valor de dos variables, accediendo a
  // su dirección de memoria dado que usa el paso por referencia 
  cambio(&a, &b);

  printf("a vale %d y b vale %d\n", a, b);

  return 0;
}

void cambio (int *p, int *q)
{
  int aux;
  aux = *p;
  *p = *q;
  *q = aux;
  
  //no hay return porque la funcion es de tipo void
}
#+END_SRC

#+RESULTS:
| a | vale | 1 | y | b | vale | 7 |
| a | vale | 7 | y | b | vale | 1 |


* Suma de un vector

Diseña un programa que calcule la suma de un vector, su valor más alto y la media de sus valores, usando una función basada en punteros.
#+BEGIN_SRC C :exports code
int sumaVector(int vector[], int n, int *max, float *media);#+END_SRC

#+RESULTS:

#+BEGIN_SRC C
// Solución con notación de vectores
#include <stdio.h>

int sumaVector(int vector[], int n, int *max, float *media);

int main()
{
  int vals[] = {1, 2, 3, 4, 5, 6, 7, 8, 9};
  int suma, max;
  float media;
  
  suma = sumaVector(vals, 9, &max, &media);

  printf("La suma es %i.\n", suma);
  printf("La media es %f.\n", media);
  printf("El valor maximo del vector es %i.\n", max);
    
  return 0;
}

int sumaVector(int vector[], int n, int *max, float *media)
{
  int i, suma = 0;
  *max = vector[0];
  for (i = 0; i < n; i++)
  {
    suma = suma + vector[i];	
    if(vector[i] > *max)
    {
      *max = vector[i]; 
	  }
  }
  *media = ((float)suma) / n;
  
  return suma;
}
#+END_SRC

#+RESULTS:
: La suma es 45.

